> hi @bryantbiggs , sorry for the delay. I reproduced the error by doing the following. As I said it only happens after upgrading from v18 to v19.
> 
> so first you have to apply:
> 
> ```
> terraform {
>   backend "s3" {
>     key = "terraformcopy.tfstate"
>   }
> }
> 
> provider "aws" {
>   region = "eu-west-1"
> }
> 
> resource "aws_kms_key" "eks" {
>   description             = "EKS Secret Encryption Key"
>   deletion_window_in_days = 7
>   enable_key_rotation     = true
> }
> 
> module "vpc" {
>   source  = "terraform-aws-modules/vpc/aws"
>   version = "~> 3.14"
> 
>   name = "example"
>   cidr = "10.0.0.0/16"
> 
>   azs             = ["eu-west-1a","eu-west-1b"]
>   private_subnets = ["10.0.1.0/24","10.0.2.0/24"]
>   public_subnets  = ["10.0.101.0/24","10.0.102.0/24"]
> 
>   enable_nat_gateway = true
>   enable_vpn_gateway = false
> 
>   single_nat_gateway   = true
>   enable_dns_hostnames = true
> 
>   enable_flow_log                      = false
>   create_flow_log_cloudwatch_iam_role  = false
>   create_flow_log_cloudwatch_log_group = false
> 
>   public_subnet_tags = {
>     "kubernetes.io/cluster/example" = "shared"
>     "kubernetes.io/role/elb" = 1
>   }
> 
>   private_subnet_tags = {
>     "kubernetes.io/cluster/example" = "shared"
>     "kubernetes.io/role/internal-elb" = 1
>   }
> }
> 
> module "eks" {
>   source  = "terraform-aws-modules/eks/aws"
>   version = "~> 18.0"
> 
>   cluster_name    = "example"
>   cluster_version = "1.23"
> 
>   cluster_endpoint_private_access = true
>   cluster_endpoint_public_access  = true
> 
>   cluster_addons = {
>     aws-ebs-csi-driver = {}
>     kube-proxy = {}
>     vpc-cni = {}
>   }
> 
>   cluster_encryption_config = [{
>     provider_key_arn = aws_kms_key.eks.arn
>     resources        = ["secrets"]
>   }]
> 
>   vpc_id     = module.vpc.vpc_id
>   subnet_ids = module.vpc.private_subnets
> 
>   eks_managed_node_group_defaults = {
>     iam_role_additional_policies = [
>       "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess",
>       "arn:aws:iam::aws:policy/SecretsManagerReadWrite",
>       "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy", 
>     ]
>   }
> 
>   eks_managed_node_groups = {
>     "default" = {
>       min_size       = 4
>       max_size       = 8
>       desired_size   = 4
>       instance_types = ["m5.xlarge"]
>       capacity_type  = "ON_DEMAND"
>       disk_size      = 50
> 
>       # By default, the module creates a launch template to ensure tags are propagated to instances, etc.,
>       # so we need to disable it to use the default template provided by the AWS EKS managed node group service
>       create_launch_template = false
>       launch_template_name   = ""
>     }
>   }
> 
>   # aws-auth configmap
>   create_aws_auth_configmap = false
>   manage_aws_auth_configmap = false
> 
>   // Allow nodes to access outside
>   node_security_group_additional_rules = {
>     egress_all = {
>       description      = "Node all egress"
>       protocol         = "-1"
>       from_port        = 0
>       to_port          = 0
>       type             = "egress"
>       cidr_blocks      = ["0.0.0.0/0"]
>       ipv6_cidr_blocks = ["::/0"]
>     }
>   }
> 
>   tags = {} 
> }
> ```
> 
> then you will have to `terraform init -upgrade` and apply the following:
> 
> ```
> terraform {
>   backend "s3" {
>     key = "terraformcopy.tfstate"
>   }
> }
> 
> provider "aws" {
>   region = "eu-west-1"
> }
> 
> resource "aws_kms_key" "eks" {
>   description             = "EKS Secret Encryption Key"
>   deletion_window_in_days = 7
>   enable_key_rotation     = true
> }
> 
> module "vpc" {
>   source  = "terraform-aws-modules/vpc/aws"
>   version = "~> 3.14"
> 
>   name = "example"
>   cidr = "10.0.0.0/16"
> 
>   azs             = ["eu-west-1a","eu-west-1b"]
>   private_subnets = ["10.0.1.0/24","10.0.2.0/24"]
>   public_subnets  = ["10.0.101.0/24","10.0.102.0/24"]
> 
>   enable_nat_gateway = true
>   enable_vpn_gateway = false
> 
>   single_nat_gateway   = true
>   enable_dns_hostnames = true
> 
>   enable_flow_log                      = false
>   create_flow_log_cloudwatch_iam_role  = false
>   create_flow_log_cloudwatch_log_group = false
> 
>   public_subnet_tags = {
>     "kubernetes.io/cluster/example" = "shared"
>     "kubernetes.io/role/elb" = 1
>   }
> 
>   private_subnet_tags = {
>     "kubernetes.io/cluster/example" = "shared"
>     "kubernetes.io/role/internal-elb" = 1
>   }
> }
> 
> module "eks" {
>   source  = "terraform-aws-modules/eks/aws"
>   version = "~> 19.0"
> 
>   cluster_name    = "example"
>   cluster_version = "1.23"
> 
>   cluster_endpoint_private_access = true
>   cluster_endpoint_public_access  = true
> 
>   cluster_addons = {
>     aws-ebs-csi-driver = {} 
>     kube-proxy = {}
>     vpc-cni = {}
>   }
> 
>   cluster_encryption_config = {
>     provider_key_arn = aws_kms_key.eks.arn
>     resources        = ["secrets"]
>   }
> 
>   vpc_id     = module.vpc.vpc_id
>   subnet_ids = module.vpc.private_subnets
> 
>   eks_managed_node_group_defaults = {
>     instance_types = ["m5.xlarge"]
>     iam_role_attach_cni_policy = true
>     iam_role_additional_policies = {
>       AmazonS3ReadOnlyAccess = "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess",
>       SecretsManagerReadWrite = "arn:aws:iam::aws:policy/SecretsManagerReadWrite",
>       AmazonEBSCSIDriverPolicy = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy", 
>     }
>   }
> 
>   eks_managed_node_groups = {
>     "default" = {
>       min_size       = 4
>       max_size       = 8
>       desired_size   = 4
>       
>       capacity_type  = "ON_DEMAND"
>       disk_size      = "50"
>       create_launch_template = false
>       use_custom_launch_template = false
>     }
>   }
> 
>   # aws-auth configmap
>   create_aws_auth_configmap = false 
>   manage_aws_auth_configmap = false
> 
>   # Allow nodes to access outside
>   node_security_group_additional_rules = {
>     egress_all = {
>       description      = "Node all egress"
>       protocol         = "-1"
>       from_port        = 0
>       to_port          = 0
>       type             = "egress"
>       cidr_blocks      = ["0.0.0.0/0"]
>       ipv6_cidr_blocks = ["::/0"]
>     }
>   }
> 
>   tags = {} 
> }
> ```
> 
> In my case I tried it 3 times and always with same behavior. In the first upgrade it will fail returning this error:
> 
> ```
> module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Still creating... [2m0s elapsed]
> ╷
> │ Error: reading IAM Role Managed Policy Attachment (default-eks-node-group-20230210153441130000000001:arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy): couldn't find resource
> │ 
> │   with module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"],
> │   on .terraform/modules/eks/modules/eks-managed-node-group/main.tf line 444, in resource "aws_iam_role_policy_attachment" "additional":
> │  444: resource "aws_iam_role_policy_attachment" "additional" {
> │ 
> ╵
> ```
> 
> but if you try to apply it again it does it without problems. then if you try to apply it again it will try to add 2 new resources that weren't before:
> 
> ```
> Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
>   + create
>   ~ update in-place
>  <= read (data resources)
> 
> Terraform will perform the following actions:
> 
>   # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
>   # (depends on a resource or a module with changes pending)
>  <= data "aws_eks_addon_version" "this" {
>       + addon_name         = "aws-ebs-csi-driver"
>       + id                 = (known after apply)
>       + kubernetes_version = "1.23"
>       + version            = (known after apply)
>     }
> 
>   # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
>   # (depends on a resource or a module with changes pending)
>  <= data "aws_eks_addon_version" "this" {
>       + addon_name         = "kube-proxy"
>       + id                 = (known after apply)
>       + kubernetes_version = "1.23"
>       + version            = (known after apply)
>     }
> 
>   # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
>   # (depends on a resource or a module with changes pending)
>  <= data "aws_eks_addon_version" "this" {
>       + addon_name         = "vpc-cni"
>       + id                 = (known after apply)
>       + kubernetes_version = "1.23"
>       + version            = (known after apply)
>     }
> 
>   # module.eks.data.tls_certificate.this[0] will be read during apply
>   # (depends on a resource or a module with changes pending)
>  <= data "tls_certificate" "this" {
>       + certificates = (known after apply)
>       + id           = (known after apply)
>       + url          = "https://oidc.eks.eu-west-1.amazonaws.com/id/61749DD73746E3A80EA8F82E8E7F19F4"
>     }
> 
>   # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be updated in-place
>   ~ resource "aws_eks_addon" "this" {
>       ~ addon_version     = "v1.15.0-eksbuild.1" -> (known after apply)
>         id                = "example:aws-ebs-csi-driver"
>         tags              = {}
>         # (7 unchanged attributes hidden)
> 
>         # (1 unchanged block hidden)
>     }
> 
>   # module.eks.aws_eks_addon.this["kube-proxy"] will be updated in-place
>   ~ resource "aws_eks_addon" "this" {
>       ~ addon_version     = "v1.23.7-eksbuild.1" -> (known after apply)
>         id                = "example:kube-proxy"
>         tags              = {}
>         # (7 unchanged attributes hidden)
> 
>         # (1 unchanged block hidden)
>     }
> 
>   # module.eks.aws_eks_addon.this["vpc-cni"] will be updated in-place
>   ~ resource "aws_eks_addon" "this" {
>       ~ addon_version     = "v1.10.4-eksbuild.1" -> (known after apply)
>         id                = "example:vpc-cni"
>         tags              = {}
>         # (7 unchanged attributes hidden)
> 
>         # (1 unchanged block hidden)
>     }
> 
>   # module.eks.aws_eks_cluster.this[0] will be updated in-place
>   ~ resource "aws_eks_cluster" "this" {
>         id                        = "example"
>         name                      = "example"
>         tags                      = {}
>         # (11 unchanged attributes hidden)
> 
>       ~ encryption_config {
>             # (1 unchanged attribute hidden)
> 
>           ~ provider {
>               ~ key_arn = "arn:aws:kms:eu-west-1:646572333546:key/5a5ea30c-285b-4f09-94b7-1b578c4968a9" -> "arn:aws:kms:eu-west-1:646572333546:key/bf0d07eb-d422-48b8-8914-f16f91f98347"
>             }
>         }
> 
>         # (3 unchanged blocks hidden)
>     }
> 
>   # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
>   ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
>         id              = "arn:aws:iam::646572333546:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/61749DD73746E3A80EA8F82E8E7F19F4"
>         tags            = {
>             "Name" = "example-eks-irsa"
>         }
>       ~ thumbprint_list = [
>           - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
>           - "06b25927c42a721631c1efd9431e648fa62e1e39",
>           - "917e732d330f9a12404f73d8bea36948b929dffc",
>           - "bc02d93ab35b617c527611b977ca09ef76c81bb5",
>         ] -> (known after apply)
>         # (4 unchanged attributes hidden)
>     }
> 
>   # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
>   + resource "aws_iam_role_policy_attachment" "this" {
>       + id         = (known after apply)
>       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
>       + role       = "example-cluster-20230210153441130600000002"
>     }
> 
>   # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
>   + resource "aws_iam_role_policy_attachment" "this" {
>       + id         = (known after apply)
>       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
>       + role       = "example-cluster-20230210153441130600000002"
>     }
> 
> Plan: 2 to add, 5 to change, 0 to destroy.
> ```
> 
> and from here each time you apply you will get the 5 changes.

Hey there! I upgraded last night and since then it's happening the same to me. I've also tested your code on a new account and got the same result.

Did you find anything more? Also @bryantbiggs could you please reopen the issue while we figure out what's happening?